app/controllers/posts_controller.rb

def load_forum
@topic = Topic.find(params[:topic_id])
---
SELECT * FROM "topics" WHERE ("topics"."id" = 2)

  def show
    @post = @topic.posts.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2 AND ("posts".topic_id = 2))

   def create
@post = @topic.posts.build(params[:post])

respond_to do |format|
if @post.save
---
INSERT INTO "posts" ("created_at", "body", "updated_at", "subject", "topic_id") VALUES('2010-05-01 01:28:06', 'woohoo it works', '2010-05-01 01:28:06', 'test post', NULL)